app/controllers/books_controller.rb

def index
	@books = Book.all
---
SELECT "post_books".* FROM "post_books"

def create
	@book = Book.new(book_params)
	@book.user_id = current_user.id
	if @book.save
		redirect_to book_path(@book)
		flash[:create] = "You have created book successfully."
	else
		@books = Book.page(params[:page]).reverse_order
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test3"], ["body", "aaaaaa"], ["user_id", 2], ["created_at", "2019-11-19 02:38:22.802966"], ["updated_at", "2019-11-19 02:38:22.802966"]]
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"