app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @users = User.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "post_books".* FROM "post_books" WHERE "post_books"."user_id" = ? ORDER BY "post_books"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_books" WHERE "post_books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "4ecbee7aecdb681c80e6fb68909cc51fde48ea1f27f017aa6b4079f1a374"], ["introduction", "user1"], ["updated_at", "2019-11-19 11:33:58.619209"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)